app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.save
---
INSERT INTO "tasks" ("name", "done", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sazsaz"], ["done", "t"], ["created_at", "2016-02-16 14:18:50.958544"], ["updated_at", "2016-02-16 14:18:50.958544"]]

  def update
    @task.update(task_params)
---
UPDATE "tasks" SET "name" = ?, "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "gdsiuqdg3783"], ["done", "t"], ["updated_at", "2016-02-16 14:36:19.755969"], ["id", 6]]